---
kind: type
id: T:Autodesk.Revit.DB.IFCExportOptions
source: html/db8ed2bb-8949-7a7f-e09a-29f6c9916f42.htm
---
# Autodesk.Revit.DB.IFCExportOptions

IFC Export options.

## Syntax (C#)
```csharp
public class IFCExportOptions : IDisposable
```